Revit 2027 API
CoordinationModelLinkData.DisplayPath Property
 The user visible saved path of the local or Autodesk Docs file referenced by the Coordination Model link.
 For a Coordination Model from Autodesk Docs, displayPath should be like "Autodesk Docs://AccountName/ProjectName/Project Files/Nested/3DView".
 For a local Coordination Model, displayPath should be like "c:\Models\local.nwc", when the saved path type is absolute.
 For a local Coordination Model, displayPath should be like "local.nwc", when the saved path type is relative.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string DisplayPath { get; }
Public ReadOnly Property DisplayPath As String
	Get
public:
property String^ DisplayPath {
	String^ get ();
}
member DisplayPath : string with get
Property Value
String
See Also
Reference
CoordinationModelLinkData Class
Autodesk.Revit.DB.ExternalData Namespace